In [4]:
import pandas as pd
import numpy as np

### Pandas dataframe with two-dimensional list

In [4]:
list2d = [['January', 21], ['February', 18], ['March', 28]]

df_from_list2d = pd.DataFrame(list2d, columns=['Month', 'Count'])

In [5]:
df_from_list2d

      Month  Count
0   January     21
1  February     18
2     March     28

### Dataframe from dict of lists

In [22]:
dictoflist = {'Category':['Array', 'Stack', 'Queue'], 
              'Marks':[20, 21, 19]}

df_from_dictoflist = pd.DataFrame(dictoflist)

In [23]:
df_from_dictoflist

  Category  Marks
0    Array     20
1    Stack     21
2    Queue     19

### Dataframe from list of dicts

In [18]:
listofdicts = [{'Category': 'Array', 'Marks': 20},
               {'Category': 'Stack'},
               {'Category': 'Queue', 'Marks': 19, 'Final': 22}]

df_from_listofdicts = pd.DataFrame(listofdicts)

In [19]:
df_from_listofdicts

  Category  Marks  Final
0    Array   20.0    NaN
1    Stack    NaN    NaN
2    Queue   19.0   22.0

### Dataframe from list of tuples

In [12]:
listoftuples = [('Peter', 18, 7),
        ('John', 17, 8),
        ('Michel', 18, 7),
        ('Sheli', 17, 5)]

df_from_listoftuples = pd.DataFrame(listoftuples, columns=['Name', 'Age', 'Score'])

In [13]:
df_from_listoftuples

     Name  Age  Score
0   Peter   18      7
1    John   17      8
2  Michel   18      7
3   Sheli   17      5

### Pivoting Example

In [37]:
mylist = [
    {
        'Name': 'Max',
        'Scores': [
            {'Subject': 'Math', 'Score': 88, 'Grade': 'B'},
            {'Subject': 'Science', 'Score': 90, 'Grade': 'B'},
            {'Subject': 'History', 'Score': 90, 'Grade': 'B'}
        ]
    },
    {
        'Name': 'Leo',
        'Scores': [
            {'Subject': 'Math', 'Score': 75, 'Grade': 'D'},
            {'Subject': 'Science', 'Score': 83, 'Grade': 'C'},
            {'Subject': 'History', 'Score': 89, 'Grade': 'B'}
        ]
    },
    {
        'Name': 'Ella',
        'Scores': [
            {'Subject': 'Math', 'Score': 89, 'Grade': 'B'},
            {'Subject': 'Science', 'Score': 94, 'Grade': 'A'},
            {'Subject': 'History', 'Score': 92, 'Grade': 'A'}
        ]
    }
]

In [40]:
students = []

for student in mylist:
    name = student['Name']
    
    for s in student['Scores']:
        s['Name'] = name
        students.append(s)

students_df = pd.DataFrame(students)
students_df

   Subject  Score Grade  Name
0     Math     88     B   Max
1  Science     90     B   Max
2  History     90     B   Max
3     Math     75     D   Leo
4  Science     83     C   Leo
5  History     89     B   Leo
6     Math     89     B  Ella
7  Science     94     A  Ella
8  History     92     A  Ella

In [51]:
students_df.pivot_table(columns=['Subject'], index=['Name'])

          Score
Subject History Math Science
Name
Ella         92   89      94
Leo          89   75      83
Max          90   88      90

In [52]:
pivoted_df = students_df.pivot_table(columns=['Subject'], values=['Score'], index='Name').reset_index()

pivoted_df.columns = ['Name', 'History', 'Math', 'Science']

In [53]:
pivoted_df

   Name  History  Math  Science
0  Ella       92    89       94
1   Leo       89    75       83
2   Max       90    88       90

### Combine many Series into a Dataframe

In [22]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [25]:
df = pd.DataFrame({'Col1': ser1, 'Col2': ser2})

In [27]:
df.head()

  Col1  Col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

In [32]:
new_df = pd.concat([ser1, ser2], axis=1)
new_df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

### How to get the items of Series A not present in Series B

In [29]:
ser_A = pd.Series([1,2,3,4,5])
ser_B = pd.Series([4,5,6])

ser_A[~ser_A.isin(ser_B)]

0    1
1    2
2    3
dtype: int64